tony-cloud/STM32_duino/STM32/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.subboard=Specific Board
menu.clock_source=Clock source
menu.osc_speed=OSC Speed(MHz)
menu.cpu_speed=cpu Speed(MHz)
menu.jtag_swd=JTAG/SWD debugging
menu.extern_lib=Extern lib
menu.upload_method=Upload method
menu.usb=USB
menu.serial=Serial communication

#################################### Nucleo-64 ############################################
# NUCLEO 64 board
NUCLEO_64.name=Nucleo-64
NUCLEO_64.vid.0=0x0483
NUCLEO_64.pid.0=0x374B

NUCLEO_64.build.core=arduino
NUCLEO_64.build.board=NUCLEO_64
NUCLEO_64.upload.tool=nucleoFlasher

NUCLEO_64.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART2

NUCLEO_64.menu.subboard.Nucleo_F030R8=Nucleo-F030R8(48M)
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.mcu=cortex-m0
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.series=STM32F0
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.variant=NUCLEO_F030R8
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.board=NUCLEO_F030R8
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.f_cpuhsi=48000000L
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.f_cpuhse=48000000L
NUCLEO_64.menu.subboard.Nucleo_F030R8.build.extra_flags=-DSTM32F030R8
NUCLEO_64.menu.subboard.Nucleo_F030R8.upload.maximum_size=65536
NUCLEO_64.menu.subboard.Nucleo_F030R8.upload.maximum_data_size=8192
NUCLEO_64.menu.subboard.Nucleo_F030R8.massstorage_drive=NODE_F030R8

NUCLEO_64.menu.subboard.Nucleo_L053R8=Nucleo-L053R8(32M)
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.mcu=cortex-m0
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.series=STM32L0
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.variant=NUCLEO_L053R8
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.board=Nucleo_L053R8
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.f_cpuhsi=32000000L
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.f_cpuhse=32000000L
NUCLEO_64.menu.subboard.Nucleo_L053R8.build.extra_flags=-DSTM32L053R8
NUCLEO_64.menu.subboard.Nucleo_L053R8.upload.maximum_size=65536
NUCLEO_64.menu.subboard.Nucleo_L053R8.upload.maximum_data_size=8192
NUCLEO_64.menu.subboard.Nucleo_L053R8.massstorage_drive=NODE_L053R8

NUCLEO_64.menu.subboard.Nucleo_F103RB=Nucleo-F103RB(HSI48M/HSE72M)
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.mcu=cortex-m3
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.series=STM32F1
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.variant=NUCLEO_F103RB
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.board=NUCLEO_F103RB
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.f_cpuhsi=48000000L
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.f_cpuhse=72000000L
NUCLEO_64.menu.subboard.Nucleo_F103RB.build.extra_flags=-DSTM32F103RB
NUCLEO_64.menu.subboard.Nucleo_F103RB.upload.maximum_size=131072
NUCLEO_64.menu.subboard.Nucleo_F103RB.upload.maximum_data_size=20480
NUCLEO_64.menu.subboard.Nucleo_F103RB.massstorage_drive=NODE_F103RB

NUCLEO_64.menu.subboard.Nucleo_F303RE=Nucleo-F303RE(HSI48M/HSE72M)
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.series=STM32F3
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.variant=NUCLEO_F303RE
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.board=NUCLEO_F303RE
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.f_cpuhsi=48000000L
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.f_cpuhse=72000000L
NUCLEO_64.menu.subboard.Nucleo_F303RE.build.extra_flags=-DSTM32F303RE
NUCLEO_64.menu.subboard.Nucleo_F303RE.upload.maximum_size=524288
NUCLEO_64.menu.subboard.Nucleo_F303RE.upload.maximum_data_size=81920
NUCLEO_64.menu.subboard.Nucleo_F303RE.massstorage_drive=NODE_F303RE

NUCLEO_64.menu.subboard.Nucleo_F401RE=Nucleo-F401RE(84M)
NUCLEO_64.menu.subboard.Nucleo_F401RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
NUCLEO_64.menu.subboard.Nucleo_F401RE.build.series=STM32F4
NUCLEO_64.menu.subboard.Nucleo_F401RE.build.variant=NUCLEO_F401RE
NUCLEO_64.menu.subboard.Nucleo_F401RE.build.board=NUCLEO_F401RE
NUCLEO_64.menu.subboard.Nucleo_F401RE.build.f_cpuhsi=84000000L
NUCLEO_64.menu.subboard.Nucleo_F401RE.build.f_cpuhse=84000000L
NUCLEO_64.menu.subboard.Nucleo_F401RE.build.extra_flags=-DSTM32F401RE
NUCLEO_64.menu.subboard.Nucleo_F401RE.upload.maximum_size=524288
NUCLEO_64.menu.subboard.Nucleo_F401RE.upload.maximum_data_size=98304
NUCLEO_64.menu.subboard.Nucleo_F401RE.massstorage_drive=NODE_F401RE

NUCLEO_64.menu.subboard.Nucleo_F411RE=Nucleo-F411RE(96M)
NUCLEO_64.menu.subboard.Nucleo_F411RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
NUCLEO_64.menu.subboard.Nucleo_F411RE.build.series=STM32F4
NUCLEO_64.menu.subboard.Nucleo_F411RE.build.variant=NUCLEO_F411RE
NUCLEO_64.menu.subboard.Nucleo_F411RE.build.board=NUCLEO_F411RE
NUCLEO_64.menu.subboard.Nucleo_F411RE.build.f_cpuhsi=96000000L
NUCLEO_64.menu.subboard.Nucleo_F411RE.build.f_cpuhse=96000000L
NUCLEO_64.menu.subboard.Nucleo_F411RE.build.extra_flags=-DSTM32F411RE
NUCLEO_64.menu.subboard.Nucleo_F411RE.upload.maximum_size=524288
NUCLEO_64.menu.subboard.Nucleo_F411RE.upload.maximum_data_size=131072
NUCLEO_64.menu.subboard.Nucleo_F411RE.massstorage_drive=NODE_F411RE

NUCLEO_64.menu.subboard.Nucleo_L152RE=Nucleo-L152RE(32M)
NUCLEO_64.menu.subboard.Nucleo_L152RE.upload.maximum_size=524288
NUCLEO_64.menu.subboard.Nucleo_L152RE.upload.maximum_data_size=81920
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.mcu=cortex-m3
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.series=STM32L1
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.variant=NUCLEO_L152RE
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.board=NUCLEO_L152RE
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.f_cpuhsi=32000000L
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.f_cpuhse=32000000L
NUCLEO_64.menu.subboard.Nucleo_L152RE.build.extra_flags=-DSTM32L152RE
NUCLEO_64.menu.subboard.Nucleo_L152RE.massstorage_drive=NODE_L152RE

NUCLEO_64.menu.subboard.Nucleo_L476RG=Nucleo-L476RG(80M)
NUCLEO_64.menu.subboard.Nucleo_L476RG.upload.maximum_size=1048576
NUCLEO_64.menu.subboard.Nucleo_L476RG.upload.maximum_data_size=131072
NUCLEO_64.menu.subboard.Nucleo_L476RG.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
NUCLEO_64.menu.subboard.Nucleo_L476RG.build.series=STM32L4
NUCLEO_64.menu.subboard.Nucleo_L476RG.build.variant=NUCLEO_L476RG
NUCLEO_64.menu.subboard.Nucleo_L476RG.build.board=NUCLEO_L476RG
NUCLEO_64.menu.subboard.Nucleo_L476RG.build.f_cpuhsi=80000000L
NUCLEO_64.menu.subboard.Nucleo_L476RG.build.f_cpuhse=80000000L
NUCLEO_64.menu.subboard.Nucleo_L476RG.build.extra_flags=-DSTM32L476RG
NUCLEO_64.menu.subboard.Nucleo_L476RG.massstorage_drive=NODE_L476RG

