tony-cloud/STM32_duino/STM32/boards.txt
GD103R.menu.osc_speed.speed_hsi=8M (HSI)
GD103R.menu.osc_speed.speed_hsi.build.osc=-DUSE_HSI

GD103R.menu.cpu_speed.F72=72M(default)
GD103R.menu.cpu_speed.F72.build.f_cpu=72000000L -DGD32F10X  {build.osc}

GD103R.menu.cpu_speed.F96=96M(Stable)
GD103R.menu.cpu_speed.F96.build.f_cpu=96000000L -DGD32F10X {build.osc}

GD103R.menu.cpu_speed.F120=120M(overdrive)
GD103R.menu.cpu_speed.F120.build.f_cpu=120000000L -DGD32F10X  {build.osc}


#---------------------------- UPLOAD METHODS ---------------------------
GD103R.menu.upload_method.jLinkMethod=JLink
GD103R.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
GD103R.menu.upload_method.jLinkMethod.upload.protocol=jlink
GD103R.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103R.menu.upload_method.STLinkMethod=STLink
GD103R.menu.upload_method.STLinkMethod.upload.protocol=STLink
GD103R.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
GD103R.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103R.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
GD103R.menu.upload_method.MassStorageMethod.upload.protocol=
GD103R.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

GD103R.menu.upload_method.serialMethod=Serial[TX/PA9, RX/PA10, BOOT0=1]
GD103R.menu.upload_method.serialMethod.upload.protocol=maple_serial
GD103R.menu.upload_method.serialMethod.upload.tool=serial_upload
GD103R.menu.upload_method.serialMethod.upload.altID=UNUSED
GD103R.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103R.menu.upload_method.serialMethod1=Serial[pl2302 AutoLoad]
GD103R.menu.upload_method.serialMethod1.upload.protocol=maple_serial
GD103R.menu.upload_method.serialMethod1.upload.tool=serial_upload
GD103R.menu.upload_method.serialMethod1.upload.altID=PL2303
GD103R.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103R.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
GD103R.menu.upload_method.serialMethod2.upload.protocol=maple_serial
GD103R.menu.upload_method.serialMethod2.upload.tool=serial_upload
GD103R.menu.upload_method.serialMethod2.upload.altID=CH340
GD103R.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103R.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
GD103R.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
GD103R.menu.upload_method.BMPMethod.upload.tool=bmp_upload

GD103R.menu.usb.Disabled=Disabled USB
GD103R.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
GD103R.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
GD103R.menu.usb.SerialMSC=Mass storage
GD103R.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
GD103R.menu.usb.Composite=Composite[CDC+MSC]
GD103R.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD


GD103R.menu.serial.Automatic=Automatically selected based on upload method
GD103R.menu.serial.SerialUART1=SerialUART1
GD103R.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
GD103R.menu.serial.SerialUSB=SerialUSB
GD103R.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

GD103R.menu.jtag_swd.default=Debug_default
GD103R.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
GD103R.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
GD103R.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14, PA13]
GD103R.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
GD103R.menu.jtag_swd.Disabled=Disabled [debug pins free]
GD103R.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

######################################GD103R_RAM#######################################
GD103R_RAM.name=GD32F103RE(Run in ram)
GD103R_RAM.vid.0=0x067B
GD103R_RAM.pid.0=0x2303

GD103R_RAM.upload.uploadadr=0x20000000
GD103R_RAM.upload.vect=0x20000000

GD103R_RAM.build.board=F103R
GD103R_RAM.build.core=arduino
GD103R_RAM.build.series=STM32F1
GD103R_RAM.build.mcu=cortex-m3

GD103R_RAM.menu.subboard.F103RE=ALIENTEK_MINI(Manage)
GD103R_RAM.menu.subboard.F103RE.upload.maximum_size=65535
GD103R_RAM.menu.subboard.F103RE.upload.maximum_data_size=20480
GD103R_RAM.menu.subboard.F103RE.upload.device=STM32F103RE
GD103R_RAM.menu.subboard.F103RE.build.extra_flags=-DSTM32F103RE -DGD32F10X
GD103R_RAM.menu.subboard.F103RE.build.variant=ATKMINI_F103R
GD103R_RAM.menu.subboard.F103RE.build.board=ATKMINI_F103RE
GD103R_RAM.menu.subboard.F103RE.build.ldscript=f103xE_man.ld
GD103R_RAM.menu.subboard.F103RE.build.extra_flags_jtag=-DMENU_DEBUG_SWD

GD103R_RAM.menu.subboard.F103RE1=ALIENTEK_MINI(44K+20K)
GD103R_RAM.menu.subboard.F103RE1.upload.maximum_size=45056
GD103R_RAM.menu.subboard.F103RE1.upload.maximum_data_size=20480
GD103R_RAM.menu.subboard.F103RE1.upload.device=STM32F103RE
GD103R_RAM.menu.subboard.F103RE1.build.extra_flags=-DSTM32F103RE -DGD32F10X -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
GD103R_RAM.menu.subboard.F103RE1.build.variant=ATKMINI_F103R
GD103R_RAM.menu.subboard.F103RE1.build.board=ATKMINI_F103RE
GD103R_RAM.menu.subboard.F103RE1.build.ldscript=f103xE_RAM0.ld
GD103R_RAM.menu.subboard.F103RE1.build.extra_flags_jtag=-DMENU_DEBUG_SWD
GD103R_RAM.menu.subboard.F103RE1.upload.uploadadr=0x20000000:45056
GD103R_RAM.menu.subboard.F103RE1.upload.vect=0x20000000
GD103R_RAM.menu.subboard.F103RE1.massstorage_drive=GD32SPI

GD103R_RAM.menu.subboard.F103RE2=GENERIC_F103RE(44K+20K)
GD103R_RAM.menu.subboard.F103RE2.upload.maximum_size=45056
GD103R_RAM.menu.subboard.F103RE2.upload.maximum_data_size=20480
GD103R_RAM.menu.subboard.F103RE2.upload.device=STM32F103RE
GD103R_RAM.menu.subboard.F103RE2.build.extra_flags=-DSTM32F103RE -DGD32F10X -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
GD103R_RAM.menu.subboard.F103RE2.build.variant=F103R_GD
GD103R_RAM.menu.subboard.F103RE2.build.board=GENERIC_F103RE
GD103R_RAM.menu.subboard.F103RE2.build.ldscript=f103xE_RAM0.ld
GD103R_RAM.menu.subboard.F103RE2.build.extra_flags_jtag=-DMENU_DEBUG_SWD
GD103R_RAM.menu.subboard.F103RE2.upload.uploadadr=0x20000000:45056
GD103R_RAM.menu.subboard.F103RE2.upload.vect=0x20000000
GD103R_RAM.menu.subboard.F103RE2.massstorage_drive=GD32SPI

GD103R_RAM.menu.osc_speed.speed_08m=8M (HSE)
GD103R_RAM.menu.osc_speed.speed_08m.build.osc=-DHSE_VALUE=8000000 -DHSE_STARTUP_TIMEOUT=((uint32_t)0xFFFF)

GD103R_RAM.menu.osc_speed.speed_12m=12M (HSE)
GD103R_RAM.menu.osc_speed.speed_12m.build.osc=-DHSE_VALUE=12000000 -DOSC=12 -DHSE_STARTUP_TIMEOUT=((uint32_t)0xFFFF)

GD103R_RAM.menu.osc_speed.speed_hsi=8M (HSI)
GD103R_RAM.menu.osc_speed.speed_hsi.build.osc=-DUSE_HSI

GD103R_RAM.menu.cpu_speed.F72=72M(default)
GD103R_RAM.menu.cpu_speed.F72.build.f_cpu=72000000L {build.osc}

