tony-cloud/STM32_duino/STM32/boards.txt
GD103R_RAM.menu.cpu_speed.F96=96M(Stable)
GD103R_RAM.menu.cpu_speed.F96.build.f_cpu=96000000L {build.osc}

GD103R_RAM.menu.cpu_speed.F120=120M(overdrive)
GD103R_RAM.menu.cpu_speed.F120.build.f_cpu=120000000L {build.osc}


#---------------------------- UPLOAD METHODS ---------------------------
GD103R_RAM.menu.upload_method.jLinkMethod=JLink(BOOT0=1 BOOT1=1)
GD103R_RAM.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
GD103R_RAM.menu.upload_method.jLinkMethod.upload.protocol=jlink
GD103R_RAM.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103R_RAM.menu.upload_method.STLinkMethod=STLink(BOOT0=1 BOOT1=1)
GD103R_RAM.menu.upload_method.STLinkMethod.upload.protocol=STLink
GD103R_RAM.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
GD103R_RAM.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

GD103R_RAM.menu.upload_method.serialMethod=Serial[pl2302 AutoLoad]
GD103R_RAM.menu.upload_method.serialMethod.upload.protocol=maple_serial
GD103R_RAM.menu.upload_method.serialMethod.upload.tool=serial_upload
GD103R_RAM.menu.upload_method.serialMethod.upload.altID=PL2303
GD103R_RAM.menu.upload_method.serialMethod.build.extra_flags=-DSTM32F103RE -DGD32F10X -DVECT_TAB_OFFSET=0x0200 -DVECT_TAB_SRAM
GD103R_RAM.menu.upload_method.serialMethod.build.variant=ATKMINI_F103R
GD103R_RAM.menu.upload_method.serialMethod.build.board=ATKMINI_F103RE
GD103R_RAM.menu.upload_method.serialMethod.build.ldscript=f103xE_RAM200.ld
GD103R_RAM.menu.upload_method.serialMethod.upload.uploadadr=0x20000200:45056
GD103R_RAM.menu.upload_method.serialMethod.upload.vect=0x20000200

GD103R_RAM.menu.usb.Disabled=Disabled USB
GD103R_RAM.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
GD103R_RAM.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
GD103R_RAM.menu.usb.SerialMSC=Mass storage
GD103R_RAM.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
GD103R_RAM.menu.usb.Composite=Composite[CDC+MSC]
GD103R_RAM.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

GD103R_RAM.menu.serial.SerialUART1=SerialUART1
GD103R_RAM.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
GD103R_RAM.menu.serial.SerialUSB=SerialUSB
GD103R_RAM.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

GD103R_RAM.menu.jtag_swd.default=Debug_default
GD103R_RAM.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
GD103R_RAM.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
GD103R_RAM.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14, PA13]
GD103R_RAM.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
GD103R_RAM.menu.jtag_swd.Disabled=Disabled [debug pins free]
GD103R_RAM.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

######################################F103R#######################################
F103R.name=F103R
F103R.vid.0=0x067B
F103R.pid.0=0x2303

F103R.upload.uploadadr=0x08000000
F103R.upload.vect=0x08000000

F103R.build.board=F103R
F103R.build.core=arduino
F103R.build.series=STM32F1
F103R.build.mcu=cortex-m3

F103R.menu.subboard.F103RB=ALIENTEK_MINI[F103RB/SWD]
F103R.menu.subboard.F103RB.upload.maximum_size=131072
F103R.menu.subboard.F103RB.upload.maximum_data_size=20480
F103R.menu.subboard.F103RB.upload.device=STM32F103RB
F103R.menu.subboard.F103RB.build.extra_flags=-DSTM32F103RB
F103R.menu.subboard.F103RB.build.variant=ATKMINI_F103R
F103R.menu.subboard.F103RB.build.board=ATKMINI_F103RB
F103R.menu.subboard.F103RB.build.ldscript=f103xB.ld
F103R.menu.subboard.F103RB.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103R.menu.subboard.F103RB.massstorage_drive=NUCLEO

F103R.menu.subboard.F103RE=ALIENTEK_MINI[F103RE/SWD]
F103R.menu.subboard.F103RE.upload.maximum_size=524288
F103R.menu.subboard.F103RE.upload.maximum_data_size=65536
F103R.menu.subboard.F103RE.upload.device=STM32F103RE
F103R.menu.subboard.F103RE.build.extra_flags=-DSTM32F103RE
F103R.menu.subboard.F103RE.build.variant=ATKMINI_F103R
F103R.menu.subboard.F103RE.build.board=ATKMINI_F103RE
F103R.menu.subboard.F103RE.build.ldscript=f103xE.ld
F103R.menu.subboard.F103RE.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103R.menu.subboard.F103RE.massstorage_drive=NUCLEO

F103R.menu.subboard.F103RC=GENERIC_F103RC[LED PC13/JTAG]
F103R.menu.subboard.F103RC.upload.maximum_size=262144
F103R.menu.subboard.F103RC.upload.maximum_data_size=49152
F103R.menu.subboard.F103RC.upload.device=STM32F103RC
F103R.menu.subboard.F103RC.build.extra_flags=-DSTM32F103RC
F103R.menu.subboard.F103RC.build.variant=F103R
F103R.menu.subboard.F103RC.build.board=GENERIC_F103RC
F103R.menu.subboard.F103RC.build.ldscript=f103xC.ld
F103R.menu.subboard.F103RC.massstorage_drive=NUCLEO

F103R.menu.subboard.F103RE1=GENERIC_F103RE[LED PC13/JTAG]
F103R.menu.subboard.F103RE1.upload.maximum_size=524288
F103R.menu.subboard.F103RE1.upload.maximum_data_size=65536
F103R.menu.subboard.F103RE1.upload.device=STM32F103RE
F103R.menu.subboard.F103RE1.build.extra_flags=-DSTM32F103RE
F103R.menu.subboard.F103RE1.build.variant=F103R
F103R.menu.subboard.F103RE1.build.board=GENERIC_F103RE
F103R.menu.subboard.F103RE1.build.ldscript=f103xE.ld
F103R.menu.subboard.F103RE1.massstorage_drive=NUCLEO

F103R.menu.subboard.F103RF=GENERIC_F103RF[LED PC13/JTAG]
F103R.menu.subboard.F103RF.upload.maximum_size=786432
F103R.menu.subboard.F103RF.upload.maximum_data_size=98304
F103R.menu.subboard.F103RF.upload.device=STM32F103RF
F103R.menu.subboard.F103RF.build.extra_flags=-DSTM32F103RF
F103R.menu.subboard.F103RF.build.variant=F103R
F103R.menu.subboard.F103RF.build.board=GENERIC_F103RF
F103R.menu.subboard.F103RF.build.ldscript=f103xF.ld
F103R.menu.subboard.F103RF.massstorage_drive=NUCLEO

F103R.menu.subboard.F103RG=GENERIC_F103RG[LED PC13/JTAG]
F103R.menu.subboard.F103RG.upload.maximum_size=1048576
F103R.menu.subboard.F103RG.upload.maximum_data_size=98304
F103R.menu.subboard.F103RG.pload.device=STM32F103RG
F103R.menu.subboard.F103RG.build.extra_flags=-DSTM32F103RG
F103R.menu.subboard.F103RG.build.variant=F103R
F103R.menu.subboard.F103RG.build.board=GENERIC_F103RG
F103R.menu.subboard.F103RG.build.ldscript=f103xG.ld
F103R.menu.subboard.F103RG.massstorage_drive=NUCLEO

F103R.menu.osc_speed.speed_08m=8M(HSE)_72M
F103R.menu.osc_speed.speed_08m.build.f_cpu=72000000L -DHSE_VALUE=8000000
F103R.menu.osc_speed.speed_hsi=8M(HSI)_48M
F103R.menu.osc_speed.speed_hsi.build.f_cpu=48000000L -DUSE_HSI

#---------------------------- UPLOAD METHODS ---------------------------
F103R.menu.upload_method.STLinkMethod=STLink 
F103R.menu.upload_method.STLinkMethod.upload.protocol=STLink
F103R.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F103R.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103R.menu.upload_method.jLinkMethod=JLink
F103R.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103R.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103R.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103R.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
F103R.menu.upload_method.MassStorageMethod.upload.protocol=
F103R.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F103R.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1, BOOT1=0]
F103R.menu.upload_method.serialMethod.upload.protocol=maple_serial
F103R.menu.upload_method.serialMethod.upload.tool=serial_upload
F103R.menu.upload_method.serialMethod.upload.altID=UNUSED
F103R.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103R.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F103R.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F103R.menu.upload_method.serialMethod1.upload.tool=serial_upload
F103R.menu.upload_method.serialMethod1.upload.altID=PL2303
F103R.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103R.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F103R.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F103R.menu.upload_method.serialMethod2.upload.tool=serial_upload
F103R.menu.upload_method.serialMethod2.upload.altID=CH340
F103R.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103R.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F103R.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F103R.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F103R.menu.usb.Disabled=Disabled USB
F103R.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
F103R.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F103R.menu.usb.SerialMSC=Mass storage
F103R.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F103R.menu.usb.Composite=Composite[CDC+MSC]
F103R.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F103R.menu.serial.SerialUART1=SerialUART1
F103R.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F103R.menu.serial.SerialUSB=SerialUSB
F103R.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
F103R.menu.serial.Automatic=Automatically selected based on upload method

F103R.menu.jtag_swd.default=Debug_default
F103R.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
F103R.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F103R.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F103R.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103R.menu.jtag_swd.Disabled=Disabled [debug pins free]
F103R.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

######################################F103R_RAM#######################################
F103R_RAM.name=F103R(Run in ram)
F103R_RAM.vid.0=0x067B
F103R_RAM.pid.0=0x2303

F103R_RAM.upload.uploadadr=0x20000000
F103R_RAM.upload.vect=0x20000000

F103R_RAM.build.board=F103R
F103R_RAM.build.core=arduino
F103R_RAM.build.series=STM32F1
F103R_RAM.build.mcu=cortex-m3

F103R_RAM.menu.subboard.F103RE=ALIENTEK_MINI[F103RE/SWD](44K+20K)
F103R_RAM.menu.subboard.F103RE.upload.maximum_size=524288
F103R_RAM.menu.subboard.F103RE.upload.maximum_data_size=65536
F103R_RAM.menu.subboard.F103RE.upload.device=STM32F103RE
F103R_RAM.menu.subboard.F103RE.build.extra_flags=-DSTM32F103RE -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103R_RAM.menu.subboard.F103RE.build.variant=ATKMINI_F103R
F103R_RAM.menu.subboard.F103RE.build.board=ATKMINI_F103RE
F103R_RAM.menu.subboard.F103RE.build.ldscript=f103xE_RAM0.ld

F103R_RAM.menu.subboard.F103RE1=GENERIC_F103RE[LED PC13/JTAG](44K+20K)
F103R_RAM.menu.subboard.F103RE1.upload.maximum_size=524288
F103R_RAM.menu.subboard.F103RE1.upload.maximum_data_size=65536
F103R_RAM.menu.subboard.F103RE1.upload.device=STM32F103RE
F103R_RAM.menu.subboard.F103RE1.build.extra_flags=-DSTM32F103RE -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103R_RAM.menu.subboard.F103RE1.build.variant=F103R
F103R_RAM.menu.subboard.F103RE1.build.board=GENERIC_F103RE
F103R_RAM.menu.subboard.F103RE1.build.ldscript=f103xE_RAM0.ld

