tony-cloud/STM32_duino/STM32/boards.txt
F103R_RAM.menu.subboard.F103RF=GENERIC_F103RF[LED PC13/JTAG](44K+20K)
F103R_RAM.menu.subboard.F103RF.upload.maximum_size=786432
F103R_RAM.menu.subboard.F103RF.upload.maximum_data_size=98304
F103R_RAM.menu.subboard.F103RF.upload.device=STM32F103RF
F103R_RAM.menu.subboard.F103RF.build.extra_flags=-DSTM32F103RF -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103R_RAM.menu.subboard.F103RF.build.variant=F103R
F103R_RAM.menu.subboard.F103RF.build.board=GENERIC_F103RF
F103R_RAM.menu.subboard.F103RF.build.ldscript=f103xF_RAM0.ld

F103R_RAM.menu.subboard.F103RG=GENERIC_F103RG[LED PC13/JTAG](44K+20K)
F103R_RAM.menu.subboard.F103RG.upload.maximum_size=1048576
F103R_RAM.menu.subboard.F103RG.upload.maximum_data_size=98304
F103R_RAM.menu.subboard.F103RG.pload.device=STM32F103RG
F103R_RAM.menu.subboard.F103RG.build.extra_flags=-DSTM32F103RG -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103R_RAM.menu.subboard.F103RG.build.variant=F103R
F103R_RAM.menu.subboard.F103RG.build.board=GENERIC_F103RG
F103R_RAM.menu.subboard.F103RG.build.ldscript=f103xF_RAM0.ld

F103R_RAM.menu.osc_speed.speed_08m=8M(HSE)_72M
F103R_RAM.menu.osc_speed.speed_08m.build.f_cpu=72000000L -DHSE_VALUE=8000000
F103R_RAM.menu.osc_speed.speed_hsi=8M(HSI)_48M
F103R_RAM.menu.osc_speed.speed_hsi.build.f_cpu=48000000L -DUSE_HSI

#---------------------------- UPLOAD METHODS ---------------------------
F103R_RAM.menu.upload_method.jLinkMethod=JLink(BOOT0=1 BOOT1=1)
F103R_RAM.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103R_RAM.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103R_RAM.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103R_RAM.menu.upload_method.STLinkMethod=STLink(BOOT0=1 BOOT1=1)
F103R_RAM.menu.upload_method.STLinkMethod.upload.protocol=STLink
F103R_RAM.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F103R_RAM.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB


F103R_RAM.menu.usb.Disabled=Disabled USB
F103R_RAM.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
F103R_RAM.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F103R_RAM.menu.usb.SerialMSC=Mass storage
F103R_RAM.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F103R_RAM.menu.usb.Composite=Composite[CDC+MSC]
F103R_RAM.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F103R_RAM.menu.serial.SerialUART1=SerialUART1
F103R_RAM.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F103R_RAM.menu.serial.SerialUSB=SerialUSB
F103R_RAM.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
F103R_RAM.menu.serial.Automatic=Automatically selected based on upload method

F103R_RAM.menu.jtag_swd.default=Debug_default
F103R_RAM.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
F103R_RAM.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F103R_RAM.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F103R_RAM.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103R_RAM.menu.jtag_swd.Disabled=Disabled [debug pins free]
F103R_RAM.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

##################################F103V board##############################################
F103V.name=F103V
F103V.vid.0=0x067B
F103V.pid.0=0x2303

F103V.build.mcu=cortex-m3
F103V.build.board=GENERIC_F103V
F103V.build.core=arduino
F103V.build.series=STM32F1
F103V.build.f_cpu=72000000L

F103V.upload.uploadadr=0x08000000
F103V.upload.vect=0x08000000

F103V.menu.subboard.F103VE=ArmFly_X2[F103VE PL2303]
F103V.menu.subboard.F103VE.upload.maximum_size=524288
F103V.menu.subboard.F103VE.upload.maximum_data_size=65536
F103V.menu.subboard.F103VE.upload.device=STM32F103VE
F103V.menu.subboard.F103VE.build.extra_flags=-DSTM32F103VE
F103V.menu.subboard.F103VE.build.variant=ARMFLY_X2_F103VE
F103V.menu.subboard.F103VE.build.board=ARMFLY_X2
F103V.menu.subboard.F103VE.build.ldscript=f103xE.ld
F103V.menu.subboard.F103VE.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VE.upload.protocol=maple_serial
F103V.menu.subboard.F103VE.upload.tool=serial_upload
F103V.menu.subboard.F103VE.upload.altID=
F103V.menu.subboard.F103VE.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VB=GENERIC_F103VB[CH430]
F103V.menu.subboard.F103VB.upload.maximum_size=131072
F103V.menu.subboard.F103VB.upload.maximum_data_size=20480
F103V.menu.subboard.F103VB.upload.device=STM32F103VB
F103V.menu.subboard.F103VB.build.extra_flags=-DSTM32F103VB
F103V.menu.subboard.F103VB.build.variant=F103V
F103V.menu.subboard.F103VB.build.board=GENERIC_F103VB
F103V.menu.subboard.F103VB.build.ldscript=f103xB.ld
F103V.menu.subboard.F103VB.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VB.upload.protocol=maple_serial
F103V.menu.subboard.F103VB.upload.tool=serial_upload
F103V.menu.subboard.F103VB.upload.altID=CH340
F103V.menu.subboard.F103VB.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VC=GENERIC_F103VC[CH430]
F103V.menu.subboard.F103VC.upload.maximum_size=262144
F103V.menu.subboard.F103VC.upload.maximum_data_size=49152
F103V.menu.subboard.F103VC.upload.device=STM32F103VC
F103V.menu.subboard.F103VC.build.extra_flags=-DSTM32F103VC
F103V.menu.subboard.F103VC.build.variant=F103V
F103V.menu.subboard.F103VC.build.board=GENERIC_F103VC
F103V.menu.subboard.F103VC.build.ldscript=f103xC.ld
F103V.menu.subboard.F103VC.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VC.upload.protocol=maple_serial
F103V.menu.subboard.F103VC.upload.tool=serial_upload
F103V.menu.subboard.F103VC.upload.altID=CH340
F103V.menu.subboard.F103VC.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VE1=GENERIC_F103VE[CH430]
F103V.menu.subboard.F103VE1.upload.maximum_size=524288
F103V.menu.subboard.F103VE1.upload.maximum_data_size=65536
F103V.menu.subboard.F103VE1.upload.device=STM32F103VE
F103V.menu.subboard.F103VE1.build.extra_flags=-DSTM32F103VE
F103V.menu.subboard.F103VE1.build.variant=F103V
F103V.menu.subboard.F103VE1.build.board=GENERIC_F103VE
F103V.menu.subboard.F103VE1.build.ldscript=f103xE.ld
F103V.menu.subboard.F103VE1.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VE1.upload.protocol=maple_serial
F103V.menu.subboard.F103VE1.upload.tool=serial_upload
F103V.menu.subboard.F103VE1.upload.altID=CH340
F103V.menu.subboard.F103VE1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VF=GENERIC_F103VF[CH340]
F103V.menu.subboard.F103VF.upload.maximum_size=786432
F103V.menu.subboard.F103VF.upload.maximum_data_size=98304
F103V.menu.subboard.F103VF.upload.device=STM32F103VF
F103V.menu.subboard.F103VF.build.extra_flags=-DSTM32F103VF
F103V.menu.subboard.F103VF.build.variant=F103V
F103V.menu.subboard.F103VF.build.board=GENERIC_F103VF
F103V.menu.subboard.F103VF.build.ldscript=f103xF.ld
F103V.menu.subboard.F103VF.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VF.upload.protocol=maple_serial
F103V.menu.subboard.F103VF.upload.tool=serial_upload
F103V.menu.subboard.F103VF.upload.altID=CH340
F103V.menu.subboard.F103VF.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.subboard.F103VG=GENERIC_F103VG[CH340]
F103V.menu.subboard.F103VG.upload.maximum_size=1048576
F103V.menu.subboard.F103VG.upload.maximum_data_size=98304
F103V.menu.subboard.F103VG.upload.device=STM32F103VG
F103V.menu.subboard.F103VG.build.extra_flags=-DSTM32F103VG
F103V.menu.subboard.F103VG.build.variant=F103V
F103V.menu.subboard.F103VG.build.board=GENERIC_F103VG
F103V.menu.subboard.F103VG.build.ldscript=f103xG.ld
F103V.menu.subboard.F103VG.massstorage_drive=NUCLEO
F103V.menu.subboard.F103VG.upload.protocol=maple_serial
F103V.menu.subboard.F103VG.upload.tool=serial_upload
F103V.menu.subboard.F103VG.upload.altID=CH340
F103V.menu.subboard.F103VG.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.extern_lib.NONE = NONE
F103V.menu.extern_lib.STemWin =STemWin
F103V.menu.extern_lib.STemWin.build.extra_lib={build.system.path}/EXTRALIB/STemWin/
F103V.menu.extern_lib.STemWin.build.extra_flags_os=-DOS_SUPPORT=0
F103V.menu.extern_lib.STemWinOS =STemWin_OS
F103V.menu.extern_lib.STemWinOS.build.extra_lib={build.system.path}/EXTRALIB/STemWin/STemWin532_CM3_OS_GCC.a
F103V.menu.extern_lib.STemWinOS.build.extra_flags_os=-DOS_SUPPORT=1

#---------------------------- UPLOAD METHODS ---------------------------
F103V.menu.upload_method.default=Upload default

F103V.menu.upload_method.STLinkMethod=STLink
F103V.menu.upload_method.STLinkMethod.upload.protocol=STLink
F103V.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F103V.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F103V.menu.upload_method.jLinkMethod=JLink
F103V.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103V.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103V.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

