tony-cloud/STM32_duino/STM32/boards.txt
F103V.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
F103V.menu.upload_method.MassStorageMethod.upload.protocol=
F103V.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F103V.menu.upload_method.serialMethod=Serial UART1 [TX/PA9, RX/PA10, BOOT0=1]
F103V.menu.upload_method.serialMethod.upload.protocol=maple_serial
F103V.menu.upload_method.serialMethod.upload.tool=serial_upload
F103V.menu.upload_method.serialMethod.upload.altID=UNUSED
F103V.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F103V.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F103V.menu.upload_method.serialMethod1.upload.tool=serial_upload
F103V.menu.upload_method.serialMethod1.upload.altID=PL2303
F103V.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F103V.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F103V.menu.upload_method.serialMethod2.upload.tool=serial_upload
F103V.menu.upload_method.serialMethod2.upload.altID=CH340
F103V.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F103V.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F103V.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F103V.menu.usb.Disabled=Disabled USB
F103V.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
F103V.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F103V.menu.usb.SerialMSC=Mass storage
F103V.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F103V.menu.usb.Composite=Composite[CDC+MSC]
F103V.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F103V.menu.serial.defalt=Automatically selected based on upload method
F103V.menu.serial.SerialUART1=SerialUART1
F103V.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1

F103V.menu.serial.SerialUSB=SerialUSB
F103V.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

F103V.menu.serial.SerialUART2=SerialUART2
F103V.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2

F103V.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4, PB3,PA15,PA14,PA13]
F103V.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F103V.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F103V.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103V.menu.jtag_swd.Disabled=Disabled [debug pins free]
F103V.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

##################################F103V_RAM. board##############################################
F103V_RAM.name=F103V(Run in ram)
F103V_RAM.vid.0=0x067B
F103V_RAM.pid.0=0x2303

F103V_RAM.build.mcu=cortex-m3
F103V_RAM.build.board=GENERIC_F103V
F103V_RAM.build.core=arduino
F103V_RAM.build.series=STM32F1
F103V_RAM.build.f_cpu=72000000L

F103V_RAM.upload.uploadadr=0x20000000
F103V_RAM.upload.vect=0x20000000

F103V_RAM.menu.subboard.F103RE1=ArmFly_X2(Bootloader Manage)
F103V_RAM.menu.subboard.F103RE1.upload.maximum_size=65535
F103V_RAM.menu.subboard.F103RE1.upload.maximum_data_size=20480
F103V_RAM.menu.subboard.F103RE1.upload.device=STM32F103VE
F103V_RAM.menu.subboard.F103RE1.build.extra_flags=-DSTM32F103VE
F103V_RAM.menu.subboard.F103RE1.build.variant=ARMFLY_X2_F103VE
F103V_RAM.menu.subboard.F103RE1.build.board=ARMFLY_X2
F103V_RAM.menu.subboard.F103RE1.build.ldscript=f103xE_ram20.ld
F103V_RAM.menu.subboard.F103RE1.upload.uploadadr=0x08000000
F103V_RAM.menu.subboard.F103RE1.upload.vect=0x08000000
F103V_RAM.menu.subboard.F103RE1.massstorage_drive=NUCLEO
F103V_RAM.menu.subboard.F103RE1.upload.protocol=maple_serial
F103V_RAM.menu.subboard.F103RE1.upload.tool=serial_upload
F103V_RAM.menu.subboard.F103RE1.upload.altID=PL2303
F103V_RAM.menu.subboard.F103RE1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103V_RAM.menu.subboard.F103RE0=ArmFly_X2(44K+20K)
F103V_RAM.menu.subboard.F103RE0.upload.maximum_size=41984
F103V_RAM.menu.subboard.F103RE0.upload.maximum_data_size=20480
F103V_RAM.menu.subboard.F103RE0.upload.device=STM32F103VE
F103V_RAM.menu.subboard.F103RE0.build.extra_flags=-DSTM32F103VE -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103V_RAM.menu.subboard.F103RE0.build.variant=ARMFLY_X2_F103VE
F103V_RAM.menu.subboard.F103RE0.build.board=ARMFLY_X2
F103V_RAM.menu.subboard.F103RE0.build.ldscript=f103xE_RAM0.ld
F103V_RAM.menu.subboard.F103RE0.upload.uploadadr=0x20000000
F103V_RAM.menu.subboard.F103RE0.upload.vect=0x20000000

F103V_RAM.menu.subboard.F103VE1=GENERIC_F103VE(44K+20K)
F103V_RAM.menu.subboard.F103VE1.upload.maximum_size=524288
F103V_RAM.menu.subboard.F103VE1.upload.maximum_data_size=65536
F103V_RAM.menu.subboard.F103VE1.upload.device=STM32F103VE
F103V_RAM.menu.subboard.F103VE1.build.extra_flags=-DSTM32F103VE -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103V_RAM.menu.subboard.F103VE1.build.variant=F103V
F103V_RAM.menu.subboard.F103VE1.build.board=GENERIC_F103VE
F103V_RAM.menu.subboard.F103VE1.build.ldscript=f103xE_RAM0.ld
F103V_RAM.menu.subboard.F103VE1.upload.uploadadr=0x20000000
F103V_RAM.menu.subboard.F103VE1.upload.vect=0x20000000

F103V_RAM.menu.subboard.F103VF=GENERIC_F103VF(44K+20K)
F103V_RAM.menu.subboard.F103VF.upload.maximum_size=786432
F103V_RAM.menu.subboard.F103VF.upload.maximum_data_size=98304
F103V_RAM.menu.subboard.F103VF.upload.device=STM32F103VF
F103V_RAM.menu.subboard.F103VF.build.extra_flags=-DSTM32F103VF -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103V_RAM.menu.subboard.F103VF.build.variant=F103V
F103V_RAM.menu.subboard.F103VF.build.board=GENERIC_F103VF
F103V_RAM.menu.subboard.F103VF.build.ldscript=f103xF_RAM0.ld
F103V_RAM.menu.subboard.F103VF.upload.uploadadr=0x20000000
F103V_RAM.menu.subboard.F103VF.upload.vect=0x20000000

F103V_RAM.menu.subboard.F103VG=GENERIC_F103VG(44K+20K)
F103V_RAM.menu.subboard.F103VG.upload.maximum_size=1048576
F103V_RAM.menu.subboard.F103VG.upload.maximum_data_size=98304
F103V_RAM.menu.subboard.F103VG.upload.device=STM32F103VG
F103V_RAM.menu.subboard.F103VG.build.extra_flags=-DSTM32F103VG -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103V_RAM.menu.subboard.F103VG.build.variant=F103V
F103V_RAM.menu.subboard.F103VG.build.board=GENERIC_F103VG
F103V_RAM.menu.subboard.F103VG.build.ldscript=f103xF_RAM0.ld
F103V_RAM.menu.subboard.F103VG.upload.uploadadr=0x20000000
F103V_RAM.menu.subboard.F103VG.upload.vect=0x20000000


#---------------------------- UPLOAD METHODS ---------------------------
F103V_RAM.menu.upload_method.jLinkMethod=JLink(BOOT0=1 BOOT1=1)
F103V_RAM.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103V_RAM.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103V_RAM.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

