tony-cloud/STM32_duino/STM32/boards.txt
F103Z.menu.upload_method.serialMethod1=Serial[pl2302 AutoLoad]
F103Z.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F103Z.menu.upload_method.serialMethod1.upload.tool=serial_upload
F103Z.menu.upload_method.serialMethod1.upload.altID=PL2303
F103Z.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103Z.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F103Z.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F103Z.menu.upload_method.serialMethod2.upload.tool=serial_upload
F103Z.menu.upload_method.serialMethod2.upload.altID=CH340
F103Z.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103Z.menu.usb.Disabled=Disabled USB
F103Z.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
F103Z.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F103Z.menu.usb.SerialMSC=Mass storage
F103Z.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F103Z.menu.usb.Composite=Composite[CDC+MSC]
F103Z.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F103Z.menu.serial.Automatic=Serial_default
F103Z.menu.serial.SerialUART1=SerialUART1
F103Z.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F103Z.menu.serial.SerialUART2=SerialUART2
F103Z.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F103Z.menu.serial.SerialUART3=SerialUART3
F103Z.menu.serial.SerialUART3.build.extra_flags_serial=-DMENU_SERIAL=SerialUART3
F103Z.menu.serial.SerialUSB=SerialUSB
F103Z.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

F103Z.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
F103Z.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F103Z.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F103Z.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103Z.menu.jtag_swd.Disabled=Disabled [debug pins free]
F103Z.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

###################################### F103Z_RAM ##########################################
F103Z_RAM.name=F103Z(Run in ram)

F103Z_RAM.upload.uploadadr=0x20000000
F103Z_RAM.upload.vect=0x20000000

F103Z_RAM.build.mcu=cortex-m3
F103Z_RAM.build.board=F103Z
F103Z_RAM.build.core=arduino
F103Z_RAM.build.series=STM32F1
F103Z_RAM.build.f_cpu=72000000L

F103Z_RAM.menu.subboard.F103ZE1=HY_RedBull_V2(44K+20K)
F103Z_RAM.menu.subboard.F103ZE1.upload.maximum_size=524288
F103Z_RAM.menu.subboard.F103ZE1.upload.maximum_data_size=524288
F103Z_RAM.menu.subboard.F103ZE1.upload.device=STM32F103ZE
F103Z_RAM.menu.subboard.F103ZE1.build.variant=REDBULL_V2_F103ZE
F103Z_RAM.menu.subboard.F103ZE1.build.board=REDBULL
F103Z_RAM.menu.subboard.F103ZE1.build.extra_flags=-DSTM32F103ZE -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103Z_RAM.menu.subboard.F103ZE1.build.ldscript=f103xE_RAM0.ld
F103Z_RAM.menu.subboard.F103ZE1.upload.uploadadr=0x20000000
F103Z_RAM.menu.subboard.F103ZE1.upload.vect=0x20000000

F103Z_RAM.menu.subboard.F103ZE2=HASEE_V3(44K+20K)
F103Z_RAM.menu.subboard.F103ZE2.upload.maximum_size=524288
F103Z_RAM.menu.subboard.F103ZE2.upload.maximum_data_size=65536
F103Z_RAM.menu.subboard.F103ZE2.upload.device=STM32F103ZE
F103Z_RAM.menu.subboard.F103ZE2.build.variant=HASEE_III_F103ZE
#F103Z_RAM.menu.subboard.F103ZE2.build.variant=HASEE_III_F103ZE -DDATA_IN_ExtSRAM
F103Z_RAM.menu.subboard.F103ZE2.build.board=HASEE_V3
F103Z_RAM.menu.subboard.F103ZE2.build.extra_flags=-DSTM32F103ZE -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103Z_RAM.menu.subboard.F103ZE2.build.ldscript=f103xE_RAM0.ld
F103Z_RAM.menu.subboard.F103ZE2.upload.uploadadr=0x20000000
F103Z_RAM.menu.subboard.F103ZE2.upload.vect=0x20000000

F103Z_RAM.menu.subboard.DOFLYE=DOFLYE_M3S(44K+20K)
F103Z_RAM.menu.subboard.DOFLYE.upload.maximum_size=524288
F103Z_RAM.menu.subboard.DOFLYE.upload.maximum_data_size=65536
F103Z_RAM.menu.subboard.DOFLYE.upload.device=STM32F103ZE
F103Z_RAM.menu.subboard.DOFLYE.build.variant=DOFLYE_M3S_F103ZE
F103Z_RAM.menu.subboard.DOFLYE.build.board=DOFLYE_M3S
F103Z_RAM.menu.subboard.DOFLYE.build.extra_flags=-DSTM32F103ZE -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103Z_RAM.menu.subboard.DOFLYE.build.ldscript=f103xE_RAM0.ld
F103Z_RAM.menu.subboard.DOFLYE.upload.uploadadr=0x20000000
F103Z_RAM.menu.subboard.DOFLYE.upload.vect=0x20000000

F103Z_RAM.menu.subboard.F103ZE=GENERIC_F103ZE(44K+20K)
F103Z_RAM.menu.subboard.F103ZE.upload.maximum_size=524288
F103Z_RAM.menu.subboard.F103ZE.upload.maximum_data_size=65536
F103Z_RAM.menu.subboard.F103ZE.upload.device=STM32F103ZE
F103Z_RAM.menu.subboard.F103ZE.build.variant=F103Z
F103Z_RAM.menu.subboard.F103ZE.build.board=GENERIC_F103ZE
F103Z_RAM.menu.subboard.F103ZE.build.extra_flags=-DSTM32F103ZE -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103Z_RAM.menu.subboard.F103ZE.build.ldscript=f103xE_RAM0.ld
F103Z_RAM.menu.subboard.F103ZE.upload.uploadadr=0x20000000
F103Z_RAM.menu.subboard.F103ZE.upload.vect=0x20000000

F103Z_RAM.menu.subboard.F103ZF=GENERIC_F103ZF(44K+20K)
F103Z_RAM.menu.subboard.F103ZF.upload.maximum_size=786432
F103Z_RAM.menu.subboard.F103ZF.upload.maximum_data_size=98304
F103Z_RAM.menu.subboard.F103ZF.upload.device=STM32F103ZF
F103Z_RAM.menu.subboard.F103ZF.build.extra_flags=-DSTM32F103ZF -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103Z_RAM.menu.subboard.F103ZF.build.variant=F103Z
F103Z_RAM.menu.subboard.F103ZF.build.board=GENERIC_F103ZF
F103Z_RAM.menu.subboard.F103ZF.build.ldscript=f103xF_RAM0.ld
F103Z_RAM.menu.subboard.F103ZF.upload.uploadadr=0x20000000
F103Z_RAM.menu.subboard.F103ZF.upload.vect=0x20000000

F103Z_RAM.menu.subboard.F103ZG=GENERIC_F103ZG(44K+20K)
F103Z_RAM.menu.subboard.F103ZG.upload.maximum_size=1048576
F103Z_RAM.menu.subboard.F103ZG.upload.maximum_data_size=98304
F103Z_RAM.menu.subboard.F103ZG.upload.device=STM32F103ZG
F103Z_RAM.menu.subboard.F103ZG.build.extra_flags=-DSTM32F103ZG -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
F103Z_RAM.menu.subboard.F103ZG.build.series=STM32F1
F103Z_RAM.menu.subboard.F103ZG.build.variant=F103Z
F103Z_RAM.menu.subboard.F103ZG.build.board=GENERIC_F103ZG
F103Z_RAM.menu.subboard.F103ZG.build.ldscript=f103xF_RAM0.ld
F103Z_RAM.menu.subboard.F103ZG.upload.uploadadr=0x20000000
F103Z_RAM.menu.subboard.F103ZG.upload.vect=0x20000000

#---------------------------- UPLOAD METHODS ---------------------------
F103Z_RAM.menu.upload_method.jLinkMethod=JLink(BOOT0=1 BOOT1=1)
F103Z_RAM.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F103Z_RAM.menu.upload_method.jLinkMethod.upload.protocol=jlink
F103Z_RAM.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103Z_RAM.menu.upload_method.STLinkMethod=STLink(BOOT0=1 BOOT1=1)
F103Z_RAM.menu.upload_method.STLinkMethod.upload.protocol=STLink
F103Z_RAM.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F103Z_RAM.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F103Z_RAM.menu.usb.Disabled=Disabled USB
F103Z_RAM.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/12]
F103Z_RAM.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F103Z_RAM.menu.usb.SerialMSC=Mass storage
F103Z_RAM.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F103Z_RAM.menu.usb.Composite=Composite[CDC+MSC]
F103Z_RAM.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F103Z_RAM.menu.serial.SerialUART1=SerialUART1
F103Z_RAM.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F103Z_RAM.menu.serial.SerialUART2=SerialUART2
F103Z_RAM.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F103Z_RAM.menu.serial.SerialUART3=SerialUART3
F103Z_RAM.menu.serial.SerialUART3.build.extra_flags_serial=-DMENU_SERIAL=SerialUART3
F103Z_RAM.menu.serial.SerialUSB=SerialUSB
F103Z_RAM.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

F103Z_RAM.menu.jtag_swd.JTAG=JTAG [debug pins reserved: PB4,PB3,PA15,PA14,PA13]
F103Z_RAM.menu.jtag_swd.JTAG.build.extra_flags_jtag=-DMENU_DEBUG_JTAG
F103Z_RAM.menu.jtag_swd.SWD=SWD [debug pins reserved: PA14,PA13]
F103Z_RAM.menu.jtag_swd.SWD.build.extra_flags_jtag=-DMENU_DEBUG_SWD
F103Z_RAM.menu.jtag_swd.Disabled=Disabled [debug pins free]
F103Z_RAM.menu.jtag_swd.Disabled.build.extra_flags_jtag=-DMENU_DEBUG_DISABLED

##################################### F401S ###########################################
F401S.name=F401S

F401S.vid.1=0x0483
F401S.pid.1=0x5740

F401S.upload.maximum_size=262144
F401S.upload.maximum_data_size=65536
F401S.upload.uploadadr=0x08000000
F401S.upload.vect=0x08000000

F401S.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
F401S.build.core=arduino
F401S.build.board=F401NANO
F401S.build.series=STM32F4

F401S.menu.subboard.CCU6F=NANO_CCU6(STLink)
F401S.menu.subboard.CCU6F.upload.maximum_size=262144
F401S.menu.subboard.CCU6F.upload.maximum_data_size=65536
F401S.menu.subboard.CCU6F.build.variant=F401C
F401S.menu.subboard.CCU6F.build.board=F401NANO
F401S.menu.subboard.CCU6F.build.extra_flags=-DSTM32F401CC
F401S.menu.subboard.CCU6F.massstorage_drive=NUCLEO
#default upload method
F401S.menu.subboard.CCU6F.upload.device=STM32F401CC
F401S.menu.subboard.CCU6F.upload.tool=stlink_upload
F401S.menu.subboard.CCU6F.upload.protocol=STLink
F401S.menu.subboard.CCU6F.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F401S.menu.osc_speed.speed_08m=8M (HSE)
F401S.menu.osc_speed.speed_08m.build.osc=-DHSE_VALUE=8000000 -DOSC=8

F401S.menu.osc_speed.speed_12m=12M (HSE)
F401S.menu.osc_speed.speed_12m.build.osc=-DHSE_VALUE=12000000 -DOSC=12

