tony-cloud/STM32_duino/STM32/boards.txt
F401S.menu.osc_speed.speed_hsi=16M (HSI)
F401S.menu.osc_speed.speed_hsi.build.osc=-DUSE_HSI

F401S.menu.cpu_speed.F84=84M(default)
F401S.menu.cpu_speed.F84.build.f_cpu=84000000L {build.osc}

F401S.menu.cpu_speed.F120=120M(Stable)
F401S.menu.cpu_speed.F120.build.f_cpu=120000000L {build.osc}

F401S.menu.cpu_speed.F144=144M(overdrive)
F401S.menu.cpu_speed.F144.build.f_cpu=144000000L {build.osc}


F401S.menu.upload_method.default=Upload default

F401S.menu.upload_method.jLinkMethod=JLink
F401S.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F401S.menu.upload_method.jLinkMethod.upload.protocol=jlink
F401S.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F401S.menu.upload_method.STLinkMethod=STLink
F401S.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F401S.menu.upload_method.STLinkMethod.upload.protocol=STLink
F401S.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F401S.menu.upload_method.MassStorageMethod=Mass Storage [STLINK V2.1]
F401S.menu.upload_method.MassStorageMethod.upload.protocol=
F401S.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher

F401S.menu.upload_method.serialMethod=Serial [TX/PA9, RX/PA10, BOOT0=1, BOOT1=0]
F401S.menu.upload_method.serialMethod.upload.protocol=maple_serial
F401S.menu.upload_method.serialMethod.upload.tool=serial_upload
F401S.menu.upload_method.serialMethod.upload.altID=UNUSED
F401S.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F401S.menu.upload_method.serialMethod2=Serial [CH340 AutoLoad]
F401S.menu.upload_method.serialMethod2.upload.protocol=maple_serial
F401S.menu.upload_method.serialMethod2.upload.tool=serial_upload
F401S.menu.upload_method.serialMethod2.upload.altID=CH340
F401S.menu.upload_method.serialMethod2.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F401S.menu.upload_method.serialMethod1=Serial [PL2303 AutoLoad]
F401S.menu.upload_method.serialMethod1.upload.protocol=maple_serial
F401S.menu.upload_method.serialMethod1.upload.tool=serial_upload
F401S.menu.upload_method.serialMethod1.upload.altID=PL2303
F401S.menu.upload_method.serialMethod1.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

F401S.menu.upload_method.BMPMethod=BMP (Black Magic Probe)
F401S.menu.upload_method.BMPMethod.upload.protocol=gdb_bmp
F401S.menu.upload_method.BMPMethod.upload.tool=bmp_upload

F401S.menu.usb.Disabled=Disabled USB
F401S.menu.usb.SerialUSB=Serial [Virtual COM port,PA11/12]
F401S.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F401S.menu.usb.SerialMSC=Mass storage
F401S.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F401S.menu.usb.Composite=Composite[CDC+MSC]
F401S.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F401S.menu.serial.Automatic=Automatically selected based on upload method
F401S.menu.serial.SerialUART1=SerialUART1
F401S.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F401S.menu.serial.SerialUSB=SerialUSB
F401S.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

##################################### F401S_RAM ###########################################
F401S_RAM.name=F401S(Run in ram)

F401S_RAM.vid.1=0x0483
F401S_RAM.pid.1=0x5740

F401S_RAM.upload.maximum_size=45056
F401S_RAM.upload.maximum_data_size=20480
F401S_RAM.upload.uploadadr=0x20000000
F401S_RAM.upload.vect=0x20000000

F401S_RAM.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
F401S_RAM.build.core=arduino
F401S_RAM.build.board=F401NANO
F401S_RAM.build.series=STM32F4

F401S_RAM.menu.subboard.CCU6F=NANO_CCU6(44K+20K)
F401S_RAM.menu.subboard.CCU6F.upload.maximum_size=45056
F401S_RAM.menu.subboard.CCU6F.upload.maximum_data_size=20480
F401S_RAM.menu.subboard.CCU6F.build.variant=F401C
F401S_RAM.menu.subboard.CCU6F.build.board=F401NANO
F401S_RAM.menu.subboard.CCU6F.build.extra_flags=-DSTM32F401CC -DVECT_TAB_SRAM
F401S_RAM.menu.subboard.CCU6F.build.ldscript=f407xC_RAM0.ld


F401S_RAM.menu.osc_speed.speed_08m=8M (HSE)
F401S_RAM.menu.osc_speed.speed_08m.build.osc=-DHSE_VALUE=8000000 -DOSC=8

F401S_RAM.menu.osc_speed.speed_12m=12M (HSE)
F401S_RAM.menu.osc_speed.speed_12m.build.osc=-DHSE_VALUE=12000000 -DOSC=12

F401S_RAM.menu.osc_speed.speed_hsi=16M (HSI)
F401S_RAM.menu.osc_speed.speed_hsi.build.osc=-DUSE_HSI

F401S_RAM.menu.cpu_speed.F84=84M(default)
F401S_RAM.menu.cpu_speed.F84.build.f_cpu=84000000L {build.osc}

F401S_RAM.menu.cpu_speed.F120=120M(Stable)
F401S_RAM.menu.cpu_speed.F120.build.f_cpu=120000000L {build.osc}

F401S_RAM.menu.cpu_speed.F144=144M(overdrive)
F401S_RAM.menu.cpu_speed.F144.build.f_cpu=144000000L {build.osc}


F401S_RAM.menu.upload_method.jLinkMethod=JLink(BOOT0=1 BOOT1=1)
F401S_RAM.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F401S_RAM.menu.upload_method.jLinkMethod.upload.protocol=jlink
F401S_RAM.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F401S_RAM.menu.upload_method.STLinkMethod=STLink(BOOT0=1 BOOT1=1)
F401S_RAM.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F401S_RAM.menu.upload_method.STLinkMethod.upload.protocol=STLink
F401S_RAM.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F401S_RAM.menu.usb.Disabled=Disabled USB
F401S_RAM.menu.usb.SerialUSB=Serial [Virtual COM port,PA11/12]
F401S_RAM.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F401S_RAM.menu.usb.SerialMSC=Mass storage
F401S_RAM.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F401S_RAM.menu.usb.Composite=Composite[CDC+MSC]
F401S_RAM.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F401S_RAM.menu.serial.SerialUART1=SerialUART1
F401S_RAM.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F401S_RAM.menu.serial.SerialUSB=SerialUSB
F401S_RAM.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

################################### F407V/Z/I #############################################
F407S.name=F407S

