tony-cloud/STM32_duino/STM32/boards.txt
F407S_RAM.menu.subboard.V11_F407V=F407VE_V11(64K+64)
F407S_RAM.menu.subboard.V11_F407V.upload.maximum_size=65536
F407S_RAM.menu.subboard.V11_F407V.upload.maximum_data_size=65536
F407S_RAM.menu.subboard.V11_F407V.build.variant=F407VE_V11
F407S_RAM.menu.subboard.V11_F407V.build.board=V11VET6
F407S_RAM.menu.subboard.V11_F407V.build.extra_flags=-DSTM32F407VE -DHSE_VALUE=8000000 -DVECT_TAB_SRAM
F407S_RAM.menu.subboard.V11_F407V.upload.device=STM32F407VE
F407S_RAM.menu.subboard.V11_F407V.build.ldscript=f407xE_RAM0.ld

F407S_RAM.menu.subboard.ArmFly_F4=ArmFly_F407ZG(64K+64)
F407S_RAM.menu.subboard.ArmFly_F4.upload.maximum_size=65536
F407S_RAM.menu.subboard.ArmFly_F4.upload.maximum_data_size=65536
F407S_RAM.menu.subboard.ArmFly_F4.build.variant=ARMFLY_F407ZG
F407S_RAM.menu.subboard.ArmFly_F4.build.board=ARMFLY_F4
F407S_RAM.menu.subboard.ArmFly_F4.build.extra_flags=-DSTM32F407ZG -DHSE_VALUE=8000000 -DVECT_TAB_SRAM
F407S_RAM.menu.subboard.ArmFly_F4.massstorage_drive=NUCLEO
F407S_RAM.menu.subboard.ArmFly_F4.upload.device=STM32F407ZG
F407S_RAM.menu.subboard.ArmFly_F4.build.ldscript=f407xE_RAM0.ld

F407S_RAM.menu.subboard.IMT407GV21=ILLUMINATI_F407ZG(64K+64)
F407S_RAM.menu.subboard.IMT407GV21.upload.maximum_size=65536
F407S_RAM.menu.subboard.IMT407GV21.upload.maximum_data_size=65536
F407S_RAM.menu.subboard.IMT407GV21.build.variant=ILLUMINATI_F407ZG
F407S_RAM.menu.subboard.IMT407GV21.build.board=IMT407GV21
F407S_RAM.menu.subboard.IMT407GV21.build.extra_flags=-DSTM32F407ZG -DHSE_VALUE=8000000 -DVECT_TAB_SRAM
F407S_RAM.menu.subboard.IMT407GV21.massstorage_drive=NUCLEO
F407S_RAM.menu.subboard.IMT407GV21.upload.device=STM32F407ZG
F407S_RAM.menu.subboard.IMT407GV21.build.ldscript=f407xE_RAM0.ld

F407S_RAM.menu.subboard.IGT6_CORE=F407IG_CORE(64K+64)
F407S_RAM.menu.subboard.IGT6_CORE.upload.maximum_size=65536
F407S_RAM.menu.subboard.IGT6_CORE.upload.maximum_data_size=65536
F407S_RAM.menu.subboard.IGT6_CORE.build.variant=F407IG_CORE
F407S_RAM.menu.subboard.IGT6_CORE.build.board=IGT6CORE
F407S_RAM.menu.subboard.IGT6_CORE.build.extra_flags=-DSTM32F407IG -DHSE_VALUE=8000000 -DVECT_TAB_SRAM
F407S_RAM.menu.subboard.IGT6_CORE.massstorage_drive=NUCLEO
F407S_RAM.menu.subboard.IGT6_CORE.upload.device=STM32F407IG
F407S_RAM.menu.subboard.IGT6_CORE.build.ldscript=f407xE_RAM0.ld

F407S_RAM.menu.subboard.GENERIC_F407V=GENERIC_F407VE(64K+64)
F407S_RAM.menu.subboard.GENERIC_F407V.upload.maximum_size=65536
F407S_RAM.menu.subboard.GENERIC_F407V.upload.maximum_data_size=65536
F407S_RAM.menu.subboard.GENERIC_F407V.build.variant=BLUE_F407VE
F407S_RAM.menu.subboard.GENERIC_F407V.build.board=GENERIC_F407VE
F407S_RAM.menu.subboard.GENERIC_F407V.build.extra_flags=-DSTM32F407VE -DHSE_VALUE=8000000 -DVECT_TAB_SRAM
F407S_RAM.menu.subboard.GENERIC_F407V.upload.device=STM32F407VE
F407S_RAM.menu.subboard.GENERIC_F407V.build.ldscript=f407xE_RAM0.ld

F407S_RAM.menu.subboard.BLACK_F407ZE=GENERIC_F407ZE(64K+64)
F407S_RAM.menu.subboard.BLACK_F407ZE.upload.maximum_size=65536
F407S_RAM.menu.subboard.BLACK_F407ZE.upload.maximum_data_size=65536
F407S_RAM.menu.subboard.BLACK_F407ZE.build.variant=BLACK_F407ZE
F407S_RAM.menu.subboard.BLACK_F407ZE.build.board=GENERIC_F407ZE
F407S_RAM.menu.subboard.BLACK_F407ZE.build.extra_flags=-DSTM32F407ZE -DHSE_VALUE=8000000 -DVECT_TAB_SRAM
F407S_RAM.menu.subboard.BLACK_F407ZE.upload.device=STM32F407ZE
F407S_RAM.menu.subboard.BLACK_F407ZE.build.ldscript=f407xE_RAM0.ld

F407S_RAM.menu.subboard.BLACK_F407ZG=GENERIC_F407ZG(64K+64)
F407S_RAM.menu.subboard.BLACK_F407ZG.upload.maximum_size=65536
F407S_RAM.menu.subboard.BLACK_F407ZG.upload.maximum_data_size=65536
F407S_RAM.menu.subboard.BLACK_F407ZG.build.variant=BLACK_F407ZG
F407S_RAM.menu.subboard.BLACK_F407ZG.build.board=GENERIC_F407ZG
F407S_RAM.menu.subboard.BLACK_F407ZG.build.extra_flags=-DSTM32F407ZG -DHSE_VALUE=8000000 -DVECT_TAB_SRAM
F407S_RAM.menu.subboard.BLACK_F407ZG.upload.device=STM32F407ZG
F407S_RAM.menu.subboard.BLACK_F407ZG.build.ldscript=f407xE_RAM0.ld

F407S_RAM.menu.upload_method.jLinkMethod=JLink(BOOT0=1 BOOT1=1)
F407S_RAM.menu.upload_method.jLinkMethod.upload.tool=jlink_upload
F407S_RAM.menu.upload_method.jLinkMethod.upload.protocol=jlink
F407S_RAM.menu.upload_method.jLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407S_RAM.menu.upload_method.STLinkMethod=STLink(BOOT0=1 BOOT1=1)
F407S_RAM.menu.upload_method.STLinkMethod.upload.protocol=STLink
F407S_RAM.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
F407S_RAM.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUSB

F407S_RAM.menu.usb.Disabled=Disabled USB
F407S_RAM.menu.usb.SerialUSB=Serial [Virtual COM port,PA11/12]
F407S_RAM.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
F407S_RAM.menu.usb.SerialMSC=Mass storage
F407S_RAM.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
F407S_RAM.menu.usb.Composite=Composite[CDC+MSC]
F407S_RAM.menu.usb.Composite.build.extra_flags_usb=-DMENU_USB_IAD

F407S_RAM.menu.serial.SerialUART1=SerialUART1
F407S_RAM.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
F407S_RAM.menu.serial.SerialUART2=SerialUART2
F407S_RAM.menu.serial.SerialUART2.build.extra_flags_serial=-DMENU_SERIAL=SerialUART2
F407S_RAM.menu.serial.SerialUART3=SerialUART3
F407S_RAM.menu.serial.SerialUART3.build.extra_flags_serial=-DMENU_SERIAL=SerialUART3
F407S_RAM.menu.serial.SerialUSB=SerialUSB
F407S_RAM.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
F407S_RAM.menu.serial.Automatic=Automatically selected based on upload method

###################################### F746S ##########################################
# Discovery F746IG board
F746S.name=F746S
F746S.vid.1=0x10C4
F746S.pid.1=0xEA60

F746S.upload.maximum_size=1048576
F746S.upload.maximum_data_size=327680
F746S.upload.uploadadr=0x08000000
F746S.upload.vect=0x08000000

F746S.build.core=arduino
F746S.build.board=WAVESHARE_F746IG

F746S.build.mcu=cortex-m7 -mfloat-abi=hard -mfpu=fpv5-sp-d16 
F746S.build.series=STM32F7
F746S.build.variant=WAVESHARE_F746IG
F746S.build.extra_flags=-DSTM32F746IG -DDATA_IN_ExtSDRAM -DHSE_VALUE=((uint32_t)8000000)
F746S.build.f_cpu=216000000L

F746S.menu.subboard.F746IG=WaveShare F746IG(1024K+320K)

